In [2]:
import sqlite3
banco = sqlite3.connect('funcionarios.db')

In [3]:
cursor = banco.cursor()

In [3]:
cursor.execute("CREATE TABLE funcionarios ( codigo integer, primeiroNome text, segundoNome text, ultimoNome text, dataNasc integer, CPF integer, RG integer, endereço text, CEP integer,cidade text, fone integer,  idDepartamento integer, função, salario integer)")
cursor.execute("INSERT INTO funcionarios Values(1, 'Fatima', 'Louise', 'Silveira', 13051958, 45959365596, 445873656,  'Avenida Aviador Rossini Morada Luna',  64062200, 'Teresina', 8635109300, 1, 'RH',  3.500)")
banco.commit()

In [29]:
cursor.execute("SELECT * FROM funcionarios")
print (cursor.fetchall())

[(1, 'Fatima', 'Louise', 'Silveira', 13051958, 45959365596, 445873656, 'Avenida Aviador Rossini Morada Luna', 64062200, 'Teresina', 8635109300, 1, 'RH', 3.5), (2, 'Gael', 'José', 'Sérgio', 8111982, 481160905, 110364028, 'Rua Primeiro de Janeiro', 65031430, 'São Luís', 9838756194, 3, 'Administrativo', 1200), (3, 'Bianca', 'Elisa', 'Sophia', 26041946, 15838051507, 466817022, 'Rua Principal', 65091009, 'Boa Vista', 98379152431, 2, 'Limpeza', 920), (4, 'Nathan', 'Enrico', 'Gomes', 14101999, 28926352412, 138335242, 'Rua Toffoli Culau', 97090670, 'Santa Maria', 5529282605, 4, 'contas a receber', 350), (5, 'Diogo', 'Iago', 'da Cruz', 9051970, 16943334263, 154274008, 'Quadra Quatro', 66815453, 'Belém', 91994547824, 6, 'assistente de midia', 3500), (6, 'Mateus', 'Gabriel', 'Nascimento', 18011972, 89937752060, 438137711, 'Rua Edgard', 7124380, 'Guarulhos', 11984719199, 5, 'recrutador', 850), (7, 'Emily', 'Mariana', 'Santos', 23051945, 48129149141, 302038358, 'Rua Treze de Maio', 65060760, 'São Miguel', 9836903502, 1, 'estagiario', 827), (2, 'Gael', 'José', 'Sérgio', 8111982, 481160905, 110364028, 'Rua Primeiro de Janeiro', 65031430, 'São Luís', 9838756194, 3, 'Administrativo', 1200), (3, 'Bianca', 'Elisa', 'Sophia', 26041946, 15838051507, 466817022, 'Rua Principal', 65091009, 'Boa Vista', 98379152431, 2, 'Limpeza', 920), (4, 'Nathan', 'Enrico', 'Gomes', 14101999, 28926352412, 138335242, 'Rua Toffoli Culau', 97090670, 'Santa Maria', 5529282605, 4, 'contas a receber', 350), (5, 'Diogo', 'Iago', 'da Cruz', 9051970, 16943334263, 154274008, 'Quadra Quatro', 66815453, 'Belém', 91994547824, 6, 'assistente de midia', 3500), (6, 'Mateus', 'Gabriel', 'Nascimento', 18011972, 89937752060, 438137711, 'Rua Edgard', 7124380, 'Guarulhos', 11984719199, 5, 'recrutador', 850), (7, 'Emily', 'Mariana', 'Santos', 23051945, 48129149141, 302038358, 'Rua Treze de Maio', 65060760, 'São Miguel', 9836903502, 1, 'estagiario', 827), (2, 'Gael', 'José', 'Sérgio', 8111982, 481160905, 110364028, 'Rua Primeiro de Janeiro', 65031430, 'São Luís', 9838756194, 3, 'Administrativo', 1200), (3, 'Bianca', 'Elisa', 'Sophia', 26041946, 15838051507, 466817022, 'Rua Principal', 65091009, 'Boa Vista', 98379152431, 2, 'Limpeza', 920), (4, 'Nathan', 'Enrico', 'Gomes', 14101999, 28926352412, 138335242, 'Rua Toffoli Culau', 97090670, 'Santa Maria', 5529282605, 4, 'contas a receber', 350), (5, 'Diogo', 'Iago', 'da Cruz', 9051970, 16943334263, 154274008, 'Quadra Quatro', 66815453, 'Belém', 91994547824, 6, 'assistente de midia', 3500), (6, 'Mateus', 'Gabriel', 'Nascimento', 18011972, 89937752060, 438137711, 'Rua Edgard', 7124380, 'Guarulhos', 11984719199, 5, 'recrutador', 850), (7, 'Emily', 'Mariana', 'Santos', 23051945, 48129149141, 302038358, 'Rua Treze de Maio', 65060760, 'São Miguel', 9836903502, 1, 'estagiario', 827), (8, 'Julio', 'Oliver', 'Pedro', 23041981, 873775106, 322424604, 'Rua São Pedro', 59139795, 'Natal', 8438480322, 2, 'Auxiliar de limpeza', 104500), (9, 'Leonardo', 'Anderson', 'Julio Alves', 24031943, 48758856870, 324749582, 'Rua Quatorze', 68038650, 'Santarém', 93993962785, 3, 'Assistente de recpção', 850), (10, 'Henrique', 'Manoel', 'Almada', 26051966, 12319598006, 430914052, 'Rua Jarbas Araújo Pina', 29116640, 'Vila Velha', 2739132055, 4, 'Contas a pagar', 250000)]

In [5]:
cursor.execute("CREATE TABLE departamentos (codigo integer PRIMARY KEY , nome text, localizacao text, CodigoFuncionarioGerente)")
print("Tabela criada com sucesso!")

Tabela criada com sucesso!

In [9]:
listadepartamento = [('1', 'RH', '', ''),
                     ('2', 'Manutenção', '' , ''),
                     ('3', 'Recepção', '', ''),
                     ('4', 'Juridico', '', ''),
                     ('5', 'Comercial', '', ''),
                     ('6', 'Administrativo', '', '')]
cursor.executemany("""INSERT INTO departamentos VALUES (?,?,?,?)""", listadepartamento)
print("Dados inseridos com sucesso!")
banco.commit()

IntegrityError: UNIQUE constraint failed: departamentos.codigo

In [18]:
listafuncionarios = [(2,'Gael', 'José', 'Sérgio', 8111982, 481160905, 110364028,'Rua Primeiro de Janeiro', 65031430, 'São Luís', 9838756194, 3, 'Administrativo', 1200),
                    (3,'Bianca', 'Elisa', 'Sophia',26041946, 15838051507, 466817022, 'Rua Principal', 65091009, 'Boa Vista', 98379152431, 2, 'Limpeza', 920), 
                    (4, 'Nathan','Enrico', 'Gomes', 14101999, 28926352412, 138335242, 'Rua Toffoli Culau', 97090670, 'Santa Maria', 5529282605, 4, 'contas a receber', 350),
                    (5,'Diogo', 'Iago', 'da Cruz', 9051970, 16943334263, 154274008, 'Quadra Quatro', 66815453, 'Belém', 91994547824, 6, 'assistente de midia', 3500),
                    (6, 'Mateus', 'Gabriel', 'Nascimento', 18011972, 89937752060, 438137711, 'Rua Edgard', 7124380, 'Guarulhos', 11984719199, 5, 'recrutador', 850),
                    (7,'Emily', 'Mariana', 'Santos', 23051945, 48129149141, 302038358, 'Rua Treze de Maio', 65060760, 'São Miguel', 9836903502, 1, 'estagiario', 827),
                    (8,'Julio', 'Oliver', 'Pedro', 23041981, 873775106, 322424604, 'Rua São Pedro', 59139795, 'Natal', 8438480322, 2, 'Auxiliar de limpeza', 104500),
                    (9,'Leonardo', 'Anderson', 'Julio Alves', 24031943, 48758856870, 324749582, 'Rua Quatorze', 68038650, 'Santarém', 93993962785, 3, 'Assistente de recpção', 850),
                    (10, 'Henrique', 'Manoel', 'Almada', 26051966, 12319598006, 430914052, 'Rua Jarbas Araújo Pina', 29116640, 'Vila Velha', 2739132055, 4, 'Contas a pagar', 250000)]

In [19]:
cursor.executemany("""INSERT INTO funcionarios VALUES (?,?,?,?,?,?,?,?,?,?,?,?,?,?)""", listafuncionarios)
print ("Dados inseridos com sucesso!")
banco.commit()

Dados inseridos com sucesso!

### A) Listar nome e sobrenome ordenado por sobrenome

In [3]:
cursor.execute("SELECT primeiroNome, ultimoNome FROM funcionarios ORDER BY ultimoNome")
print (cursor.fetchall())

[('Henrique', 'Almada'), ('Nathan', 'Gomes'), ('Leonardo', 'Julio Alves'), ('Mateus', 'Nascimento'), ('Julio', 'Pedro'), ('Emily', 'Santos'), ('Fatima', 'Silveira'), ('Bianca', 'Sophia'), ('Gael', 'Sérgio'), ('Diogo', 'da Cruz')]

### B)	Listar todos os campos de funcionários ordenados por cidade

In [4]:
cursor.execute("SELECT * FROM funcionarios ORDER BY cidade")
print (cursor.fetchall())

[(5, 'Diogo', 'Iago', 'da Cruz', 9051970, 16943334263, 154274008, 'Quadra Quatro', 66815453, 'Belém', 91994547824, 6, 'assistente de midia', 3500), (3, 'Bianca', 'Elisa', 'Sophia', 26041946, 15838051507, 466817022, 'Rua Principal', 65091009, 'Boa Vista', 98379152431, 2, 'Limpeza', 920), (6, 'Mateus', 'Gabriel', 'Nascimento', 18011972, 89937752060, 438137711, 'Rua Edgard', 7124380, 'Guarulhos', 11984719199, 5, 'recrutador', 850), (8, 'Julio', 'Oliver', 'Pedro', 23041981, 873775106, 322424604, 'Rua São Pedro', 59139795, 'Natal', 8438480322, 2, 'Auxiliar de limpeza', 104500), (4, 'Nathan', 'Enrico', 'Gomes', 14101999, 28926352412, 138335242, 'Rua Toffoli Culau', 97090670, 'Santa Maria', 5529282605, 4, 'contas a receber', 350), (9, 'Leonardo', 'Anderson', 'Julio Alves', 24031943, 48758856870, 324749582, 'Rua Quatorze', 68038650, 'Santarém', 93993962785, 3, 'Assistente de recpção', 850), (2, 'Gael', 'José', 'Sérgio', 8111982, 481160905, 110364028, 'Rua Primeiro de Janeiro', 65031430, 'São Luís', 9838756194, 3, 'Administrativo', 1200), (7, 'Emily', 'Mariana', 'Santos', 23051945, 48129149141, 302038358, 'Rua Treze de Maio', 65060760, 'São Miguel', 9836903502, 1, 'estagiario', 827), (1, 'Fatima', 'Louise', 'Silveira', 13051958, 45959365596, 445873656, 'Avenida Aviador Rossini Morada Luna', 64062200, 'Teresina', 8635109300, 1, 'RH', 3.5), (10, 'Henrique', 'Manoel', 'Almada', 26051966, 12319598006, 430914052, 'Rua Jarbas Araújo Pina', 29116640, 'Vila Velha', 2739132055, 4, 'Contas a pagar', 250000)]

### C)	Liste os funcionários que têm salário superior a R$ 1.000,00 ordenados pelo nome completo

In [25]:
cursor.execute("""SELECT * 
FROM funcionarios
WHERE salario > 1000
ORDER BY primeiroNome, segundoNome, ultimoNome""")
print (cursor.fetchall())

[(3, 'Bianca', 'Elisa', 'Sophia', '26/04/1946', '158.380.515-07', '46.681.702-2', 'Rua Principal', '65.091-009', 'Boa Vista', '98 3791-52431', 2, 'Limpeza', '920,35'), (5, 'Diogo', 'Iago', 'da Cruz', '9/05/1970', '169.433.342-63', '15.427.400-8', 'Quadra Quatro', '66.815-453', 'Belém', '91 9945-47824', 6, 'Qualidade', '3.500,78'), (7, 'Emily', 'Mariana', 'Santos', '23/05/1945', '481.291.491-41', '30.203.835-8', 'Rua Treze de Maio', '65.060-760', 'São Miguel', '98 3690-3502', 1, 'Estagiario', '827,55'), (1, 'Fatima', 'Louise', 'Silveira', '13/05/1958', '459.593.655-96', '44.587.365-6', 'Avenida Aviador Rossini Morada Luna', '64.062-200', 'Teresina', '86 3510-9300', 1, 'RH', '3.550,00'), (2, 'Gael', 'José', 'Sérgio', '8/11/1982', '481.160.905-00', '11.036.402-8', 'Rua Primeiro de Janeiro', '65.031-430', 'São Luís', '98 3875-6194', 3, 'Assitente pessoal', '1.200,58'), (10, 'Henrique', 'Manoel', 'Almada', '26/05/1966', '123.195.980-06', '43.091.405-2', 'Rua Jarbas Araújo Pina', '29.116-640', 'Vila Velha', '27 3913-2055', 4, 'Contas a pagar', '2.500,00'), (8, 'Julio', 'Oliver', 'Pedro', '23/04/1981', '288.737.751-06', '32.242.460-4', 'Rua São Pedro', '59.139-795', 'Natal', '84 3848-0322', 2, 'Auxiliar de limpeza', '1.045,00'), (9, 'Leonardo', 'Anderson', 'Julio Alves', '24/03/1943', '487.588.568-70', '32.474.958-2', 'Rua Quatorze', '68.038-650', 'Santarém', '93 9939-62785', 3, 'Assistente de recpção', '850,00'), (6, 'Mateus', 'Gabriel', 'Nascimento', '18/01/1972', '899.377.520-60', '43.813.771-1', 'Rua Edgard', '71.243-801', 'Guarulhos', '11 9847-19199', 5, 'Vendas', '850,15'), (4, 'Nathan', 'Enrico', 'Gomes', '14/10/1999', '289.263.524-12', '13.833.524-2', 'Rua Toffoli Culau', '97.090-670', 'Santa Maria', '55 2928-2605', 4, 'contas a receber', '350,45')]

### D)	Liste a data de nascimento e o primeiro nome dos funcionários ordenados do mais novo para o mais velho

In [32]:
cursor.execute("""SELECT dataNasc, primeiroNome FROM funcionarios
ORDER BY  dataNasc, primeiroNome""")
print (cursor.fetchall())

[('13/05/1958', 'Fatima'), ('14/10/1999', 'Nathan'), ('18/01/1972', 'Mateus'), ('23/04/1981', 'Julio'), ('23/05/1945', 'Emily'), ('24/03/1943', 'Leonardo'), ('26/04/1946', 'Bianca'), ('26/05/1966', 'Henrique'), ('8/11/1982', 'Gael'), ('9/05/1970', 'Diogo')]

### E)	Liste o total da folha de pagamento

In [31]:
cursor.execute("SELECT SUM(salario) FROM funcionarios")
print (cursor.fetchall())

[(3808.795,)]

### F)	Liste o nome, o nome do departamento e a função de todos os funcionários

In [30]:
cursor.execute("SELECT funcionarios.primeiroNome, departamentos.nome,funcionarios.função FROM funcionarios JOIN departamentos ON funcionarios.idDepartamento = departamentos.codigo ORDER BY funcionarios.primeiroNome")
print (cursor.fetchall())

[('Bianca', 'Manutenção', 'Limpeza'), ('Diogo', 'Administrativo', 'Qualidade'), ('Emily', 'RH', 'Estagiario'), ('Fatima', 'RH', 'RH'), ('Gael', 'Recepção', 'Assitente pessoal'), ('Henrique', 'Juridico', 'Contas a pagar'), ('Julio', 'Manutenção', 'Auxiliar de limpeza'), ('Leonardo', 'Recepção', 'Assistente de recpção'), ('Mateus', 'Comercial', 'Vendas'), ('Nathan', 'Juridico', 'contas a receber')]

### G)	Liste a quantidade de funcionários desta empresa

In [29]:
cursor.execute("SELECT COUNT(*) FROM funcionarios")
print (cursor.fetchall())

[(10,)]

### H)	Liste o nome do departamento e do funcionário ordenados por departamento e funcionário

In [28]:
cursor.execute("SELECT departamentos.nome, funcionarios.primeiroNome FROM Departamentos JOIN funcionarios ON departamentos.codigo = funcionarios.idDepartamento ORDER BY departamentos.nome, funcionarios.primeiroNome")
print (cursor.fetchall())

[('Administrativo', 'Diogo'), ('Comercial', 'Mateus'), ('Juridico', 'Henrique'), ('Juridico', 'Nathan'), ('Manutenção', 'Bianca'), ('Manutenção', 'Julio'), ('RH', 'Emily'), ('RH', 'Fatima'), ('Recepção', 'Gael'), ('Recepção', 'Leonardo')]